In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
print("pandas version\n", pd.__version__)

pandas version
 3.0.0

## 1.Pandas Series

### Creating Series(multiple way)

In [21]:
label = ['a','b','c']
list = [10,20,30]
ary = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [11]:
pd.Series(list, index = label) # giving custom label to the series, but custom series index have to be in a variable first

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(ary, index = label) # giving custom label to the series

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# 2. Dataframe

### Creating dataframe

In [217]:
data = {
    'Name':['john','Uttam','Anna','Ajay','Amit'],
    'Age':[24,27,22,32,29],
    'City':['New York','Mumbai','London','Delhi','Sydney'],
    'Salary':[70000,80000,65000,90000,75000]
}
da = pd.DataFrame(data)

da

    Name  Age      City  Salary
0   john   24  New York   70000
1  Uttam   27    Mumbai   80000
2   Anna   22    London   65000
3   Ajay   32     Delhi   90000
4   Amit   29    Sydney   75000

In [215]:
data2 = [
        ['John',28,'Newyork',65000],
        ['Uttam',24,'UP',75000],
        ['Ajay',24,'Newyork',75000],
        ['Sanjay',26,'Delhi',85000],

]

d2 = pd.DataFrame(data2)
d2

        0   1        2      3
0    John  28  Newyork  65000
1   Uttam  24       UP  75000
2    Ajay  24  Newyork  75000
3  Sanjay  26    Delhi  85000

#### add the column name to the non named dataframe

In [32]:
cl = ['Name','Age','City','Salary']
d2 = pd.DataFrame(data2,columns = cl)
d2

     Name  Age     City  Salary
0    John   28  Newyork   65000
1   Uttam   24       UP   75000
2    Ajay   24  Newyork   75000
3  Sanjay   26    Delhi   85000

### Selecting and indexing of Columns

In [218]:
da[['Name','Age','City','Salary']]

    Name  Age      City  Salary
0   john   24  New York   70000
1  Uttam   27    Mumbai   80000
2   Anna   22    London   65000
3   Ajay   32     Delhi   90000
4   Amit   29    Sydney   75000

##### Adding a new column

In [221]:
d2['Designation'] = ['Doctor','Analyst','Accountant','Teacher']
d2

        0   1        2      3 Designation
0    John  28  Newyork  65000      Doctor
1   Uttam  24       UP  75000     Analyst
2    Ajay  24  Newyork  75000  Accountant
3  Sanjay  26    Delhi  85000     Teacher

### Removing a column / row

In [213]:
# d2.drop('Designation',axis = 1,inplace= True)  # removing the column
# d2
d2.drop(0,axis = 0)  # removing the row
d2

        0   1        2      3 Designation
0    John  28  Newyork  65000      Doctor
1   Uttam  24       UP  75000     Analyst
2    Ajay  24  Newyork  75000  Accountant
3  Sanjay  26    Delhi  85000     Teacher

### Selcting Row

In [222]:
d2.loc[[0,1]]  #selecting multiple rows

       0   1        2      3 Designation
0   John  28  Newyork  65000      Doctor
1  Uttam  24       UP  75000     Analyst

### Selecting rows and column subset (data from rows & column bth)

In [228]:
d2.loc[[0,1]][[0,1]]

       0   1
0   John  28
1  Uttam  24

## Conditional Seletion

In [232]:
# da[da["Age"] > 25]['City'] # 1st way

da.loc[da['Age']>25,['City']]  # 2nd way

     City
1  Mumbai
3   Delhi
4  Sydney

In [85]:
d2[(d2["Age"] > 25) & (d2['City'] == 'Delhi')]["Salary"]  # apply two condition

3    85000
Name: Salary, dtype: int64

# 3. Missing Data

In [113]:
info ={
    'A':[1,np.nan,3,4,5],
    'B':[1,2,3,4,np.nan],
    'C':[1,np.nan,np.nan,np.nan,5]
}
dd = pd.DataFrame(info)
dd

     A    B    C
0  1.0  1.0  1.0
1  NaN  2.0  NaN
2  3.0  3.0  NaN
3  4.0  4.0  NaN
4  5.0  NaN  5.0

#### finding mising data

In [115]:
dd.isna()  # only finding the nan value basis of true or false
dd.isna().sum()  # best way to cunt missing data in all

A    1
B    1
C    3
dtype: int64

##### see that all colum have nan or any have not by true and false

In [114]:
# finding that nan isin all column or any colum doesn't contain null
dd.isna().any()

A    True
B    True
C    True
dtype: bool

### Removing the null values by two way

In [121]:
# Removing the null values - (works on basis of row)
dd.dropna()  # this will remove whole row if a single row find nan in whole row
# dd.dropna(how = 'all')  # this will remove the row if whole row is nan

     A    B    C
0  1.0  1.0  1.0

### Thresold, tells how many cells must have to be valid value if not meet that requirment then delete the row

In [128]:
dd.dropna(thresh = 2) # यह रो को तब डिलीट करता है जब कन्डिशन के हिसाब से कम से कम उतनी वैल्यू अगर वैलिड ना हो

     A    B    C
0  1.0  1.0  1.0
2  3.0  3.0  NaN
3  4.0  4.0  NaN
4  5.0  NaN  5.0

## Filling the missing data

In [129]:
dd

     A    B    C
0  1.0  1.0  1.0
1  NaN  2.0  NaN
2  3.0  3.0  NaN
3  4.0  4.0  NaN
4  5.0  NaN  5.0

In [131]:
dd.fillna(0)

     A    B    C
0  1.0  1.0  1.0
1  NaN  2.0  NaN
2  3.0  3.0  NaN
3  4.0  4.0  NaN
4  5.0  NaN  5.0

In [133]:
#Filling the defined value to column if that column have nan value here selection is on the basis of colu,n not on the basisi of row
vall = {'A':15,'B':24,'C':34}
dd.fillna(vall)

      A     B     C
0   1.0   1.0   1.0
1  15.0   2.0  34.0
2   3.0   3.0  34.0
3   4.0   4.0  34.0
4   5.0  24.0   5.0

In [135]:
# filling the data with mean of the data
dd.fillna(dd.mean())

      A    B    C
0  1.00  1.0  1.0
1  3.25  2.0  3.0
2  3.00  3.0  3.0
3  4.00  4.0  3.0
4  5.00  2.5  5.0

## Merging, Joining, Concatinating

In [137]:
employee = pd.DataFrame({
    'employee_id':[1,2,3,4,5],
    'name':['Ajay','Amit','Arjun','Uttam','Sanjay'],
    'department':['HR','IT','Finance','IT','HR']   
})

salaries = pd.DataFrame({
    'employee_id':[1,2,3,6,7],
    'salary':[55000,67000,3400,80000,45000],
    'bonus': [5000,6000,4500,6000,4000]
})

In [138]:
employee

   employee_id    name department
0            1    Ajay         HR
1            2    Amit         IT
2            3   Arjun    Finance
3            4   Uttam         IT
4            5  Sanjay         HR

In [139]:
salaries

   employee_id  salary  bonus
0            1   55000   5000
1            2   67000   6000
2            3    3400   4500
3            6   80000   6000
4            7   45000   4000

In [142]:
pd.merge(employee,salaries, on= 'employee_id', how= 'inner') # this will merge both df on the basis of matching employee_id

   employee_id   name department  salary  bonus
0            1   Ajay         HR   55000   5000
1            2   Amit         IT   67000   6000
2            3  Arjun    Finance    3400   4500

In [144]:
pd.merge(employee,salaries,on='employee_id',how='outer')  # this will oin whole df so join al all and give nan to the cell which id i
#not avilable on each other

   employee_id    name department   salary   bonus
0            1    Ajay         HR  55000.0  5000.0
1            2    Amit         IT  67000.0  6000.0
2            3   Arjun    Finance   3400.0  4500.0
3            4   Uttam         IT      NaN     NaN
4            5  Sanjay         HR      NaN     NaN
5            6     NaN        NaN  80000.0  6000.0
6            7     NaN        NaN  45000.0  4000.0

In [145]:
pd.merge(employee,salaries,on='employee_id',how='left')

   employee_id    name department   salary   bonus
0            1    Ajay         HR  55000.0  5000.0
1            2    Amit         IT  67000.0  6000.0
2            3   Arjun    Finance   3400.0  4500.0
3            4   Uttam         IT      NaN     NaN
4            5  Sanjay         HR      NaN     NaN

In [146]:
pd.merge(employee,salaries,on='employee_id',how='right')

   employee_id   name department  salary  bonus
0            1   Ajay         HR   55000   5000
1            2   Amit         IT   67000   6000
2            3  Arjun    Finance    3400   4500
3            6    NaN        NaN   80000   6000
4            7    NaN        NaN   45000   4000

### Concatination

In [207]:
d1 = pd.DataFrame({
    'A': ['apple', 'banana', 'cherry'],
    'B': ['dog', 'cat', 'bird'],
    'C': ['red', 'blue', 'green']
})

dl = pd.DataFrame({
    'A': ['house', 'tree', 'car'],
    'B': ['pen', 'book', 'desk'],
    'C': ['yellow', 'orange', 'purple']
})

In [208]:
pd.concat([d1,dl])

        A     B       C
0   apple   dog     red
1  banana   cat    blue
2  cherry  bird   green
0   house   pen  yellow
1    tree  book  orange
2     car  desk  purple

In [209]:
pd.concat([d1,dl],axis = 1)

        A     B      C      A     B       C
0   apple   dog    red  house   pen  yellow
1  banana   cat   blue   tree  book  orange
2  cherry  bird  green    car  desk  purple

### Joining 2 df

In [163]:
da1 = pd.DataFrame({
    'name':['alice','bob','charlie']
},index = [1,2,3])

da2 = pd.DataFrame({
    'score':[85,90,75]
},index = [2,3,4])

In [164]:
da1

      name
1    alice
2      bob
3  charlie

In [165]:
da1.join(da2,how='outer')

      name  score
1    alice    NaN
2      bob   85.0
3  charlie   90.0
4      NaN   75.0

In [166]:
da1.join(da2,how='left')

      name  score
1    alice    NaN
2      bob   85.0
3  charlie   90.0

In [167]:
da1.join(da2,how='right')

      name  score
2      bob     85
3  charlie     90
4      NaN     75

##  GroupBy Aggregation

In [169]:
grda = pd.DataFrame({
    'category': ['a', 'b', 'a', 'b', 'a', 'b', 'a', 'b'],
    'store': ['s1', 's1', 's2', 's2', 's1', 's2', 's2', 's1'],
    'sales': [100, 150, 200, 175, 120, 160, 180, 190],
    'Quantity': [10, 15, 20, 18, 12, 16, 18, 19],
    'date': pd.date_range('2022-02-01', periods=8)
})

grda

  category store  sales  Quantity       date
0        a    s1    100        10 2022-02-01
1        b    s1    150        15 2022-02-02
2        a    s2    200        20 2022-02-03
3        b    s2    175        18 2022-02-04
4        a    s1    120        12 2022-02-05
5        b    s2    160        16 2022-02-06
6        a    s2    180        18 2022-02-07
7        b    s1    190        19 2022-02-08

In [172]:
an = grda.groupby('category')  
for a, aa in an:
    print(a)
    print(aa)

a
  category store  sales  Quantity       date
0        a    s1    100        10 2022-02-01
2        a    s2    200        20 2022-02-03
4        a    s1    120        12 2022-02-05
6        a    s2    180        18 2022-02-07
b
  category store  sales  Quantity       date
1        b    s1    150        15 2022-02-02
3        b    s2    175        18 2022-02-04
5        b    s2    160        16 2022-02-06
7        b    s1    190        19 2022-02-08

In [180]:
ans = grda.groupby(['category','store'])[['Quantity','sales']].sum()
print("total sales by category\n",ans)

total sales by category
                 Quantity  sales
category store
a        s1           22    220
         s2           38    380
b        s1           34    340
         s2           34    335

## Aggregation

In [183]:
grda['sales'].mean()  
"""mean mode median min max count std"""

'mean mode median min max count std'

In [189]:
grda['sales'].max()
grda[['sales','Quantity']].max()

sales       200
Quantity     20
dtype: int64

#### multiuple aggrigation at a time

In [192]:
grda[['sales','Quantity']].agg(['min','max','mean'])

        sales  Quantity
min   100.000      10.0
max   200.000      20.0
mean  159.375      16.0

# Pivot table

In [235]:
ssda = pd.DataFrame({
    'date': pd.date_range('2023-09-01', periods=20),
    'product': ['A', 'B', 'C', 'D'] * 5,
    'region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'] * 2,
    'sales': [5000, 6000, 7500, 4500, 8000, 5500, 6500, 7000, 5800, 6200] * 2,
    'units': [10, 12, 15, 9, 16, 11, 13, 14, 12, 13] * 2,
    'rep': ['John', 'Alice', 'Bob', 'Carol', 'David', 'Eve', 'Frank', 'Grace', 'Henry', 'Iris'] * 2
})
ssda['Month'] = ssda['date'].dt.month_name()
ssda

         date product region  sales  units    rep      Month
0  2023-09-01       A  North   5000     10   John  September
1  2023-09-02       B  South   6000     12  Alice  September
2  2023-09-03       C   East   7500     15    Bob  September
3  2023-09-04       D   West   4500      9  Carol  September
4  2023-09-05       A  North   8000     16  David  September
5  2023-09-06       B  South   5500     11    Eve  September
6  2023-09-07       C   East   6500     13  Frank  September
7  2023-09-08       D   West   7000     14  Grace  September
8  2023-09-09       A  North   5800     12  Henry  September
9  2023-09-10       B  South   6200     13   Iris  September
10 2023-09-11       C  North   5000     10   John  September
11 2023-09-12       D  South   6000     12  Alice  September
12 2023-09-13       A   East   7500     15    Bob  September
13 2023-09-14       B   West   4500      9  Carol  September
14 2023-09-15       C  North   8000     16  David  September
15 2023-09-16       D  South   5500     11    Eve  September
16 2023-09-17       A   East   6500     13  Frank  September
17 2023-09-18       B   West   7000     14  Grace  September
18 2023-09-19       C  North   5800     12  Henry  September
19 2023-09-20       D  South   6200     13   Iris  September

In [239]:
pd.pivot_table(ssda,values = 'sales',index = 'region',columns = 'product',aggfunc = 'count')

product    A    B    C    D
region
East     2.0  NaN  2.0  NaN
North    3.0  NaN  3.0  NaN
South    NaN  3.0  NaN  3.0
West     NaN  2.0  NaN  2.0

## Operations

In [241]:
dao = pd.DataFrame({
    'A': [1,2,3,4,5],
    'B': [10,20,30,40,50],
    'C': [100,200,300,400,500]
})
dao

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [242]:
dao.shape

(5, 3)

In [244]:
dao.columns

Index(['A', 'B', 'C'], dtype='str')

In [245]:
dao.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [246]:
dao.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [ ]:
def square(x):
    return x**2

In [291]:
dao.drop(columns = ['A'], inplace = True)

##### ceating new column at first place by insert method

In [297]:
dao.insert(0,'A',[1,2,3,4,5])

In [286]:
dao

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [301]:
dao['A'] = dao['A'].apply(square)

In [303]:
dao

    A   B    C
0   1  10  100
1   4  20  200
2   9  30  300
3  16  40  400
4  25  50  500